max-bot-cf/Catalogs/энргДоговорыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>энргДоговорыКонтрагентов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.энргАбоненты</xr:Item>
				<xr:Item>Catalog.энргДоговорыКонтрагентов</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДляПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>800</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестТипыДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДоговора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестСтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестСтатусыДоговоровКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаФинансирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестГруппыФинансирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УникальныйНомерДоговораОРЭМ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>38</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговораОРЭМ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестТипыДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бестКодДоговораERP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расчетчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Архив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчетКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргФилиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПролонгацияДоговора</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачислениеПени</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособЗаключенияДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргСпособыЗаключенияДоговора</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Публичный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестВидыДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БезУслугиПоПередаче</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПролонгации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияКонтрагента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестКатегорииКонтрагента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VIPКлиент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаличиеЭкспертногоЗаключения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлектронноеВзаимодействие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестВидыЭлектронногоВзаимодействия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйЗаДоговор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Мощность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияПотребителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестКатегорииКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БлокЮридическихЛиц</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеДопСоглашения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПередачиУведомленийПИР</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестВидыЭлектронногоВзаимодействия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВзаимодействиеСЭДО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйЗаРасчеты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоставщикКонтрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТарифа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестТипыТарифаНезависимыйСбыт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеноваяКатегория</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестЦеновыеКатегории</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифнаяСетка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестТарифныеСетки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРасторжения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отрасль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргОтрасли</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Министерство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргМинистерства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузополучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Плательщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОКОПФ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОКВЭД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаСуммыДоговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияСуммыДоговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактныеЛицаКонтрагентов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КонтактноеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бестКонтактныеЛицаКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОбъектыБизнесПроцесса</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектБП</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.бестИзменитьНомерПломбыПрибораУчета</v8:Type>
								<v8:Type>cfg:DocumentRef.бестАктированиеНедопускаДопускаЮЛ</v8:Type>
								<v8:Type>cfg:DocumentRef.бестУстановитьНагрузкуПоУслугам</v8:Type>
								<v8:Type>cfg:DocumentRef.бестУстановитьФормулуРасчетаТочекУчетаНП</v8:Type>
								<v8:Type>cfg:DocumentRef.бестИзменитьПараметрыТочкиУчета</v8:Type>
								<v8:Type>cfg:DocumentRef.бестАктПринятияПрибораУчетаККоммерческомуУчету</v8:Type>
								<v8:Type>cfg:DocumentRef.бестИзменениеТемпературногоГрафикаОбъектов</v8:Type>
								<v8:Type>cfg:DocumentRef.бестУстановитьУчастиеОбъектаВРаспределенииРесурсовВМКД</v8:Type>
								<v8:Type>cfg:DocumentRef.бестУстановитьГарантированныеОбъемыНП</v8:Type>
								<v8:Type>cfg:DocumentRef.бестУстановитьЗначениеПлощадиНП</v8:Type>
								<v8:Type>cfg:DocumentRef.бестУстановитьТемпературыИсточника</v8:Type>
								<v8:Type>cfg:DocumentRef.бестИзмененитьРазрядностьОбъемовУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.бестОперацияСПриборомУчетаНП</v8:Type>
								<v8:Type>cfg:DocumentRef.бестОперацияСУслугамиНП</v8:Type>
								<v8:Type>cfg:DocumentRef.бестИзменениеПривязкиТочкиУчетаНПКСтруктуреСети</v8:Type>
								<v8:Type>cfg:DocumentRef.бестИзменитьДоговорПоУслуге</v8:Type>
								<v8:Type>cfg:DocumentRef.бестУстановитьГруппуПотребителейНП</v8:Type>
								<v8:Type>cfg:DocumentRef.бестУстановитьТемпературуНаружногоВоздуха</v8:Type>
								<v8:Type>cfg:DocumentRef.бестУстановитьТочкиПоставкиНаОбъектРасчета</v8:Type>
								<v8:Type>cfg:DocumentRef.бестУстановитьСпособНачисленияПоНормативуНП</v8:Type>
								<v8:Type>cfg:DocumentRef.бестЗаключениеДоговоровСЮридическимиЛицами</v8:Type>
								<v8:Type>cfg:DocumentRef.бестУстановитьПотребителейГВС</v8:Type>
								<v8:Type>cfg:DocumentRef.бестСменаПоставщикаНП</v8:Type>
								<v8:Type>cfg:DocumentRef.бестИзменитьДанныеДляДополнительногоРасчета</v8:Type>
								<v8:Type>cfg:DocumentRef.бестУстановитьСреднемесячнуюТемпературу</v8:Type>
								<v8:Type>cfg:DocumentRef.бестУстановитьДатуПоверкиПУ</v8:Type>
								<v8:Type>cfg:DocumentRef.бестУстановитьПоказателиТемпературыВнутриПомещения</v8:Type>
								<v8:Type>cfg:DocumentRef.бестРегистрацияБездоговорногоБезучетногоПотребления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

max-bot-cf/Catalogs/энргДоговорыКонтрагентов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДопСоглашения.Параметры.УстановитьЗначениеПараметра("Ссылка",?(Параметры.Ключ.Пустая(), Неопределено, Объект.Ссылка));
	Если Параметры.Свойство("ОснованиеДопСоглашения") Тогда
		Объект.ОснованиеДопСоглашения = Параметры.ОснованиеДопСоглашения;
	КонецЕсли;
	
	энргРаботаСПрикрепленнымиФайламиСервер.ПриСозданииНаСервере(ЭтотОбъект);
	энргЛокализацияСервер.ПриСозданииНаСервере_бестДоговорыКонтрагентов(ЭтотОбъект);	
	ЗаполнитьЗначенияСвойств(Объект, Параметры); 	
	Если Не ЗначениеЗаполнено(Объект.Организация) И Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Организация = Справочники.Организации.НашаОрганизация;
	КонецЕсли;
	РеквизитБлокЮридическихЛицПредзаполнен = Параметры.Свойство("БлокЮридическихЛиц");
	
	энргОбщегоНазначения.УстановитьДоступностьЭлементовПоРолям(ЭтотОбъект, Новый Структура("ПрисоединитьФайлСУказаниемТипа"), Метаданные.Справочники.энргДоговорыКонтрагентов, "Редактирование");
		
	бестРаботаСФормойДоговораНезависимыйСбыт.НастроитьЭлементыИнтерфейсаДоговор(ЭтотОбъект);
	УстановитьЗапретИзмененияПоСтатусу();
	ЗаполнениеБанковскогоСчетаКонтрагента(); 
	//ЗаполнениеКонтактныхЛицКонтрагента(КонтактныеЛицаКонтрагента, Объект.Контрагент);

	СписокКЛиц = Объект.КонтактныеЛицаКонтрагентов.Выгрузить().ВыгрузитьКолонку("КонтактноеЛицо");
	КонтактныеЛицаКонтрагента.ЗагрузитьЗначения(СписокКЛиц);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Модифицированность Тогда
		Отказ = Истина;
		ТекстВопроса = НСтр("ru = 'Данные были изменены. Сохранить изменения?'");
		Оповещение = Новый ОписаниеОповещения("ВопросПередЗакрытиемЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	энргРаботаСПрикрепленнымиФайламиКлиент.ПослеЗаписи(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	энргРаботаСПрикрепленнымиФайламиКлиент.ПередЗаписью(Отказ, ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	бестРаботаСНезависимымСбытом.ДополнительныеПараметрыЗаписиДатыИзменения(ТекущийОбъект, ЭтотОбъект.Модифицированность, ПараметрыЗаписи);
	РеквизитДоходный = бестРаботаСФормойДоговораНезависимыйСбыт.ИмяРеквизитаДоходный(); 
	Если бестРаботаСНезависимымСбытом.ПолучитьУчетНезависимыйСбыт() И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭтотОбъект, РеквизитДоходный) Тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("ДоходныйОснование", ЭтотОбъект[РеквизитДоходный]);
	КонецЕсли;
	
	ТекущийОбъект.КонтактныеЛицаКонтрагентов.Очистить();
	Если КонтактныеЛицаКонтрагента.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ТекущееКонтактноеЛицо Из КонтактныеЛицаКонтрагента Цикл
		
		НоваяСтрока                = ТекущийОбъект.КонтактныеЛицаКонтрагентов.Добавить();
		НоваяСтрока.КонтактноеЛицо = ТекущееКонтактноеЛицо.Значение; 
		
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	Если бестРаботаСНезависимымСбытом.ПолучитьУчетНезависимыйСбыт() Тогда 
		бестРаботаСФормойДоговораНезависимыйСбыт.ЗаполнитьСвязьНесколькихДоговоров(ЭтотОбъект);
	КонецЕсли;
	УстановитьЗапретИзмененияПоСтатусу();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Не ЗначениеЗаполнено(Объект.Ссылка) И Не РеквизитБлокЮридическихЛицПредзаполнен Тогда
		СписокОтветов = Новый СписокЗначений;
		СписокОтветов.Добавить(Истина,	"Юридическим лицом");
		СписокОтветов.Добавить(Ложь,	"Физическим лицом");
		
		Объект.БлокЮридическихЛиц = Вопрос("Договор заключается с",СписокОтветов);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	Объект.НаименованиеДляПечати = Объект.Наименование;
	
КонецПроцедуры

&НаКлиенте
Процедура НомерПриИзменении(Элемент)
	
	СформироватьНаименованиеДоговора();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	СформироватьНаименованиеДоговора();
	
КонецПроцедуры

&НаКлиенте
Процедура РайонПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Район) Тогда
		Объект.Организация = энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Район, "Организация");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	ЗаполнениеБанковскогоСчетаКонтрагента();
	ЗаполнениеКонтактныхЛицКонтрагента(КонтактныеЛицаКонтрагента, Объект.Контрагент);
КонецПроцедуры

&НаКлиенте
Процедура ТипТарифаПриИзменении(Элемент)
	УстановитьСвойстваЭлементовСвязанныхСТарифом();
КонецПроцедуры

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	УстановитьЗапретИзмененияПоСтатусу();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьРасходный(Команда)
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Перед выполнением операции необходимо записать объект.");
		Возврат;
	КонецЕсли;
	Оповещение = Новый ОписаниеОповещения("ЗаписьСвязиПослеВыбора", ЭтотОбъект);			
    МассивВидыДоговора = Новый Массив;
	МассивВидыДоговора.Добавить(ПредопределенноеЗначение("Перечисление.бестВидыДоговоров.ДоговорЭнергоснабжения"));
	МассивВидыДоговора.Добавить(ПредопределенноеЗначение("Перечисление.бестВидыДоговоров.ДоговорКуплиПродажи"));
	МассивВидыДоговора.Добавить(ПредопределенноеЗначение("Перечисление.бестВидыДоговоров.ОптовыйДоговор"));
	ЗначениеОтбора = Новый Структура("ТипДоговора, ВидДоговора", ПредопределенноеЗначение("Перечисление.бестТипыДоговоров.Расходный"), МассивВидыДоговора);
	ПараметрыПриОткрытии = Новый Структура("Отбор", ЗначениеОтбора);	
	ОткрытьФорму("Справочник.энргДоговорыКонтрагентов.Форма.ФормаВыбора", ПараметрыПриОткрытии, ЭтотОбъект,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);  
КонецПроцедуры

&НаКлиенте
Процедура Создать(Команда)
	
	Если Параметры.Ключ.Пустая() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Перед добавлением запишите объект.");
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("Справочник.энргДоговорыКонтрагентов.Форма.ФормаЭлемента", Новый Структура("ОснованиеДопСоглашения,Организация,Район,Контрагент", Объект.Ссылка,Объект.Организация,Объект.Район,Объект.Контрагент), Команда,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#Область РаботаСПрикрепляемымиФайлами

&НаКлиенте
Процедура ПрисоединитьФайлСУказаниемТипа(Команда)
	
	энргРаботаСПрикрепленнымиФайламиКлиент.ОткрытьФормуПрикрепленияФайлов(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ЗапретРедактированияРеквизитовОбъектов

&НаКлиенте
Процедура Подключаемый_РазрешитьРедактированиеРеквизитовОбъекта(Команда)
    ЗапретРедактированияРеквизитовОбъектовКлиент.РазрешитьРедактированиеРеквизитовОбъекта(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область НезависимыйСбыт

&НаСервере
Процедура УстановитьСвойстваЭлементовСвязанныхСТарифом()
	бестРаботаСФормойДоговораНезависимыйСбыт.НастроитьСвойстваРеквизитовТарифа(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура УстановитьЗапретИзмененияПоСтатусу()
	бестРаботаСФормойДоговораНезависимыйСбыт.ПроверкаЗаблокироватьРеквизитыПоСтатусу(ЭтотОбъект);
КонецПроцедуры 

&НаСервере
Процедура ЗаписьСвязиПослеВыбора(Результат, ДопПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	бестРаботаСНезависимымСбытом.ЗаписатьВРегистрСвязиДоговоров(Результат, Объект.Ссылка);
	бестРаботаСФормойДоговораНезависимыйСбыт.ЗаполнитьСвязьНесколькихДоговоров(ЭтотОбъект);
КонецПроцедуры 

#КонецОбласти

&НаКлиенте
Процедура СформироватьНаименованиеДоговора()
	
	ЭтоДопСоглашение = ЗначениеЗаполнено(Объект.ОснованиеДопСоглашения);
	Объект.Наименование = ?(ЭтоДопСоглашение, "Дополнительное соглашение", "Договор")
	+ ?(ЗначениеЗаполнено(Объект.Номер), " № " + Объект.Номер, "") 
	+ " от " + Формат(Объект.Дата, "ДФ=dd.MM.yyyy") 
	+ ?(ЭтоДопСоглашение, " к " + СтрЗаменить(энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ОснованиеДопСоглашения, "Наименование"), "Договор", "договору"), "");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнениеБанковскогоСчетаКонтрагента()
	
	МассивСчетов = бестРаботаСФормойДоговораНезависимыйСбыт.ВыборБанковскогоСчетаКонтрагента(Объект.Контрагент);
	НовыйПараметр = Новый ПараметрВыбора("Отбор.Ссылка", Новый ФиксированныйМассив(МассивСчетов));
	МассивПараметров = Новый Массив();
	МассивПараметров.Добавить(НовыйПараметр);
  	Элементы.БанковскийСчетКонтрагента.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров);
	Если МассивСчетов.Количество() = 1 Тогда
		Объект.БанковскийСчетКонтрагента = МассивСчетов[0];
	Иначе
		Объект.БанковскийСчетКонтрагента = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.БанковскиеСчета.ПустаяСсылка");
	КонецЕсли;   
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнениеКонтактныхЛицКонтрагента(КонтактныеЛицаКонтрагента, Контрагент)
	КонтактныеЛицаКонтрагента.ЗагрузитьЗначения(Справочники.бестКонтактныеЛицаКонтрагентов.ПолучитьКонтактныеЛица(Контрагент)); 
КонецПроцедуры

&НаКлиенте
Процедура ВопросПередЗакрытиемЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ПараметрыЗаписи = Новый Структура();
		ПараметрыЗаписи.Вставить("Закрыть", Истина);
		Если Записать(ПараметрыЗаписи) Тогда
			Закрыть(Объект.Ссылка);
		КонецЕсли;
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		Модифицированность = Ложь;
		Закрыть();
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ДопСоглашенияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДопСоглашения.ТекущиеДанные;
	
	ПараметрыОткрытия = Новый Структура("Ключ", ТекущиеДанные.Ссылка);
	
	ОткрытьФорму("Справочник.энргДоговорыКонтрагентов.ФормаОбъекта", ПараметрыОткрытия, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ДопСоглашенияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти
